xzcvczx/mla-legacy/Graphics MultiApp Demo/Alternative Configurations/HardwareProfile_PIC24FJ256DA210_DEV_BOARD_16PMP_MCHP_DA210_SDMSD_HID_TFT_G240320LTSW_118W_E.h
    if(led == LED_3)
      PORTSetBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTSetBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTSetBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTSetBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDOff(MMB_LED led)
{
    if(led == LED_2)
      PORTClearBits(IOPORT_D, BIT_1);

    if(led == LED_3)
      PORTClearBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTClearBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTClearBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTClearBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) ToggleLED(MMB_LED led)
{
    if(led == LED_2)
      PORTToggleBits(IOPORT_D, BIT_1);

    if(led == LED_3)
      PORTToggleBits(IOPORT_D, BIT_2);

    if(led == LED_4)
      PORTToggleBits(IOPORT_D, BIT_3);

    if(led == LED_5)
      PORTToggleBits(IOPORT_C, BIT_1);

    if(led == LED_10)
      PORTToggleBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDAllOn(void)
{
      PORTSetBits(IOPORT_D, BIT_1);
      PORTSetBits(IOPORT_D, BIT_2);
      PORTSetBits(IOPORT_D, BIT_3);
      PORTSetBits(IOPORT_C, BIT_1);
      PORTSetBits(IOPORT_C, BIT_2);

}

extern inline void __attribute__((always_inline)) TurnLEDAllOff(void)
{
      PORTClearBits(IOPORT_D, BIT_1);
      PORTClearBits(IOPORT_D, BIT_2);
      PORTClearBits(IOPORT_D, BIT_3);
      PORTClearBits(IOPORT_C, BIT_1);
      PORTClearBits(IOPORT_C, BIT_2);

}
#endif // #ifdef (MULTI_MEDIA_BOARD_DM00123)

/*********************************************************************
 *********************************************************************
 * IOS FOR THE SD Card INTERFACE
 * Used only when Demos using SD Card is enabled
 * For PIC24FJ256GB110 Use SPI1 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC24FJ256GA110 Use SPI2 only. SPI2 pins in PICtail Plus is
 * used by USB.
 * For PIC32MX360F512L Use SPI1 only. 
 ********************************************************************* 
*********************************************************************/
/* SD Card definitions: Change these to fit your application when using
   an SD-card-based physical layer                                   */
	#if defined (__32MX460F512L__)

		//SPI Configuration
		#define SPI_START_CFG_1 (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2 (SPI_ENABLE)
		// Define the SPI frequency
		#define SPI_FREQUENCY   (20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS   PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS  TRISBbits.TRISB1
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD   PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS  TRISFbits.TRISF0
		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE   PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS  TRISFbits.TRISF1

		// Description: The main SPI control register
		#define SPICON1 SPI1CON
		// Description: The SPI status register
		#define SPISTAT SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF  SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits SPI1CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE   SPICON1bits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG  SPI1BRG

		// Tris pins for SCK/SDI/SDO lines
		// Description: The TRIS bit for the SCK pin
		#define SPICLOCK    TRISFbits.TRISF6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN   TRISFbits.TRISF7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT  TRISFbits.TRISF8
		
		//SPI library functions
		#define putcSPI                     putcSPI1
		#define getcSPI                     getcSPI1
		#define OpenSPI(config1, config2)   OpenSPI1(config1, config2)

	#elif defined (__32MX360F512L__)
		//SPI Configuration
		#define SPI_START_CFG_1     (PRI_PRESCAL_64_1 | SEC_PRESCAL_8_1 | MASTER_ENABLE_ON | SPI_CKE_ON | SPI_SMP_ON)
		#define SPI_START_CFG_2     (SPI_ENABLE)

		// Define the SPI frequency
		#define SPI_FREQUENCY		(20000000)

		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB1
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB1
	            
		// Description: SD-SPI Card Detect Input bit
		#define SD_CD               PORTFbits.RF0
		// Description: SD-SPI Card Detect TRIS bit
		#define SD_CD_TRIS          TRISFbits.TRISF0

		// Description: SD-SPI Write Protect Check Input bit
		#define SD_WE               PORTFbits.RF1
		// Description: SD-SPI Write Protect Check TRIS bit
		#define SD_WE_TRIS          TRISFbits.TRISF1
	                   
		// Description: The main SPI control register
		#define SPICON1             SPI1CON
		// Description: The SPI status register
		#define SPISTAT             SPI1STAT
		// Description: The SPI Buffer
		#define SPIBUF              SPI1BUF
		// Description: The receive buffer full bit in the SPI status register
		#define SPISTAT_RBF         SPI1STATbits.SPIRBF
		// Description: The bitwise define for the SPI control register (i.e. _____bits)
		#define SPICON1bits         SPI1CONbits
		// Description: The bitwise define for the SPI status register (i.e. _____bits)
		#define SPISTATbits         SPI1STATbits
		// Description: The enable bit for the SPI module
		#define SPIENABLE           SPICON1bits.ON
		// Description: The definition for the SPI baud rate generator register (PIC32)
		#define SPIBRG			    SPI1BRG

		// Tris pins for SCK/SDI/SDO lines
		// Description: The TRIS bit for the SCK pin
		
		#define SPICLOCK            TRISFbits.TRISF6
		// Description: The TRIS bit for the SDI pin
		#define SPIIN               TRISFbits.TRISF7
		// Description: The TRIS bit for the SDO pin
		#define SPIOUT              TRISFbits.TRISF8
		//SPI library functions
		#define putcSPI             putcSPI1
		#define getcSPI             getcSPI1
		#define OpenSPI(config1, config2)   OpenSPI1(config1, config2)

		// If SPI2 on PICTail Plus Port is used use this:
		/*
		// Description: SD-SPI Chip Select Output bit
		#define SD_CS               PORTBbits.RB9
		// Description: SD-SPI Chip Select TRIS bit
		#define SD_CS_TRIS          TRISBbits.TRISB9
	    
